In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import plotly as pl
import matplotlib.pyplot as plt

In [2]:
df=pd.read_csv("cleaned_BlackFriday_sales.csv")

In [3]:
df.drop("Unnamed: 0",inplace=True,axis=1)

In [4]:
df

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,7969
...,...,...,...,...,...,...,...,...,...,...
537572,1004737,P00193542,M,36-45,16,C,1,0,1,11664
537573,1004737,P00111142,M,36-45,16,C,1,0,1,19196
537574,1004737,P00345942,M,36-45,16,C,1,0,8,8043
537575,1004737,P00285842,M,36-45,16,C,1,0,5,7172
537576,1004737,P00118242,M,36-45,16,C,1,0,5,6875

In [5]:
df.nunique()

User_ID                        5891
Product_ID                     3623
Gender                            2
Age                               7
Occupation                       21
City_Category                     3
Stay_In_Current_City_Years        5
Marital_Status                    2
Product_Category_1               18
Purchase                      17959
dtype: int64

In [6]:
df["Gender"].unique()

array(['F', 'M'], dtype=object)

we can observe that there were two genders present in Gender column they are ['F', 'M']

In [8]:
df["Age"].unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

There are 7 different age categories present in Age column they are ['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25']

In [10]:
df["Occupation"].unique()

array([10, 16, 15,  7, 20,  9,  1, 12, 17,  0,  3,  4, 11,  8, 19,  2, 18,
        5, 14, 13,  6], dtype=int64)

The occupation column also divided into 21 different categories they are [10, 16, 15,  7, 20,  9,  1, 12, 17,  0,  3,  4, 11,  8, 19,  2, 18,
        5, 14, 13,  6]

In [12]:
df["City_Category"].unique()

array(['A', 'C', 'B'], dtype=object)

There  are Three cities that are mentioned in the dataset they are ['A', 'C', 'B']

In [14]:
df["Stay_In_Current_City_Years"].unique()

array(['2', '4+', '3', '1', '0'], dtype=object)

The Stay_In_Current_City_Years column explanin about the number of years that person stayed in the city it divided into 5 groups they are['2', '4+', '3', '1', '0']

In [16]:
df["Marital_Status"].unique()

array([0, 1], dtype=int64)

This column represent the martial status of the individual 0-Unmarried,1-Married

In [18]:
df["Purchase"].sum()

5017668378

The grand total income of the company

In [20]:
df["Purchase"].mean()

9333.859852635065

Average purchase done on the black friday sale